{"ПиОА": {"Козлова Ева Фёдоровна": {"Переменные и типы данных": {"Объявлять переменные и присваивать им значения.": false, "Понимать различия между типами данных и выбирать подходящий тип для конкретной ситуации.": true, "Как создавать переменные в Python.": true, "Различные типы данных в Python (например, int, float, str, bool, list, tuple, dict).": true}, "Операции с переменными": {"Типы данных в Python (например, int, float, str).": true, "Синтаксис операций с переменными.": true, "Выполнять базовые арифметические операции с переменными.": true, "Использовать операции сравнения для сравнения значений переменных.": true}, "Конвертация типов": {"Производить конвертацию типов данных при необходимости.": true, "Различные типы данных в Python (например, int, float, str).": true, "Какие типы данных могут быть сконвертированы друг в друга без потери данных (например, целые числа во float).": true}, "Основные операторы": {"Применять операторы для выполнения различных операций в коде.": true, "Понимать приоритет операторов и использовать скобки для управления порядком выполнения операций.": true, "Различные типы операторов в Python.": false, "Какие операторы выполняют определенные операции (например, арифметические операторы для выполнения математических операций).": true}, "Условные операторы": {"Писать условные выражения для проверки различных условий в коде.": false}, "break и continue": {"break: Инструкция break используется для прерывания выполнения цикла и выхода из него, когда определенное условие выполняется.": false, "continue: Инструкция continue используется для пропуска оставшейся части кода в текущей итерации цикла и перехода к следующей итерации.": true}, "Вложенные циклы": {"Понимать, что количество итераций внутреннего цикла будет зависеть от количества итераций внешнего цикла.": true, "Писать вложенные циклы для обработки двумерных структур данных и выполнения различных операций для каждого элемента в этих структурах.": true}, "Циклы": {"Структуру и синтаксис цикла for, который используется для итерации по элементам итерируемого объекта.": true, "Структуру и синтаксис цикла while, который выполняет блок кода до тех пор, пока условие истинно.": true, "Как использовать операторы break и continue для управления выполнением циклов.": true, "Писать циклы for для выполнения действий над элементами итерируемых объектов.": true, "Писать циклы while для выполнения блока кода до выполнения определенного условия.": true, "Использовать операторы break и continue для управления выполнением циклов в зависимости от определенных условий": true}}}}